{"pages":[{"title":"travel","text":"여행 일기를 저장합니다.대만 여행","link":"/travel/index.html"}],"posts":[{"title":"나의 블로그 플랫폼 유랑기","text":"어릴 때부터 저는 제 생각과 좋은 정보를 담은 글을 올릴 블로그 서비스를 찾아, 다양한 블로그 플랫폼을 유랑했습니다. 처음에는 네이버 블로그로 시작했지만 얼마 가지 않아 불편한 UI와 여러가지 제약을 참을 수 없었습니다. 그래서 옮긴 것이 구글 블로거였습니다. 하지만 구글 블로거도 불편하기는 마찬가지였습니다. 특히 기본 주어지는 템플릿이 굉장히 예쁘지 않을 뿐더러, 사진 첨부가 너무나도 불편했습니다. 너비를 자동적으로 페이지에 맞춰 표시해주는 기능이 없어서 많은 사진을 일일이 HTML로 수정해주어야 했지요. 뿐만 아니라 개발자에 길에 들어서며, 알고 있는 지식을 글의 형태로 정리하고 다른 사람들과 공유해야 할 필요성을 느꼈습니다. 항상 문제에 부닺힐 때마다 잘 정리된 블로그에서 도움을 받으며 ‘나도 이런 지식 나눔으로 다른사람에게 도움이 되고 싶다!’라는 마음이 들었죠. 그래서 새로운 블로그 플랫폼을 찾기 시작했습니다. 눈에 들어오는 건 세 가지. 티스토리와 Medium, 그리고 Github Pages였습니다. 먼저 티스토리는 원래 초대장을 받은 사람만 개설할 수 있는, 가입이 폐쇄적인 블로그였지만 작년 10월 22일부로 초대장이 없어도 가입할 수 있게 되었죠. 제가 본 티스토리의 장점과 단점은 다음과 같습니다. 장점 심플하고 예쁜 기본 스킨 무료지만 무제한으로 제공되는 용량 개발자 친화적이며, 다양한 커스터마이징을 지원 단점 티스토리 서비스가 언제 종료될지 모름(카카오의 신뢰성이 낮음). 구시대적인 글 작성 UI 진짜 예쁜 개인 제작 스킨은 결국 유료 단점 1번이 굉장히 중요한 문제점이었기 때문에 결국 티스토리 블로그는 개설만 한 채 방치했습니다. 몇년 전 다음 클라우드나 최근 다음 아고라에 이르기까지, 돈이 되지 않는다면 무조건 서비스를 접고 보는 카카오의 행태는 ‘나의 글을 몇십년이고 기록해 둘 수 있을까?’에 대한 답을 주지 못했습니다. 이게 티스토리를 포기한 결정적인 이유입니다. 다음으로 찾아본 것은 Medium이었습니다. 미디엄은 트위터와 블로거를 창립한 Evan Williams가 2012년에 만든 온라인 출판 플랫폼인데, 컴퓨터공학 전문가들이 걸출한 글을 쓰는 곳으로 유명합니다. 이 서비스의 장점과 단점은 다음과 같습니다. 장점 아름다운 템플릿 코드 스니펫 삽입 지원 훌륭한 글 추천 시스템, 좋은 글 작성으로 수익 창출 가능 단점 한글 폰트가 기본 Serif체로 고정되며, 폰트 수정 불가 수익 모델을 만들지 못해 2017년 뉴욕과 워싱턴 지사를 폐쇄한 적이 있음 미디엄에서 강제되는 명조체는 PC에서 볼 때 굉장히 가독성이 떨어진다는 문제점이 있었습니다. 영어 글의 경우 가독성도 뛰어나고 심미적으로도 아름답지만, 한글의 경우 명조체가 역효과를 냅니다. 또한 미디움은 적절한 수익 모델을 만들지 못해 2017년에 두 지사를 폐쇄하고, 직원의 반을 해고한 적이 있습니다. 즉 ‘이 서비스가 오랫동안 유지될 수 있을까?’에 대한 의구심이 들 수 밖에 없었습니다. 물론 미디움은 지금은 한 달에 글을 몇 개 이상 읽으면, 매달 5달러를 지불하여 글 전체를 다 볼 수 있게 하는 ‘구독형 서비스’로 탈바꿈했습니다. 뉴욕타임즈와 비슷한 방식이죠. 이를 거꾸로 생각해보면, 독자들이 제 글 여러개를 읽고 싶다면 유료 구독을 할 수 밖에 없다는 이야기가 됩니다. 결국 이는 블로그의 확장성을 저하하죠. 이 문제만 해결된다면 아마 미디움으로 이전할 수도 있을 것 같네요. 그래서 마지막으로 찾아본 것은 Github pages였습니다. 요즘 개발자 사이에서 인기가 많은 플랫폼이죠. Github에서 블로그를 만들기 위해서는, Jekyll과 Hexo 등의 같은 정적 사이트 생성기(Static site generator)를 사용하여 ‘github.io’ 도메인을 만들어야 합니다. 처음엔 Jekyll에 도전했지만, 윈도우에서 ruby를 깔기가 굉장히 번거롭더군요. 루비의 하위호환성 문제 때문에 한동안 골머리를 앓다가, Hexo를 발견했습니다. 장점 자바스크립트 기반으로 설치하고 사용하기 매우 쉬움 자유도가 높으며, 커스터마이징이 편리 가입형 블로그의 ‘서비스 종료’문제를 걱정할 필요 없음 마크다운으로 글 작성 가능 다양한 아름다운 무료 템플릿 단점 자유도가 너무나 높아서 JavaScript, CSS, html을 직접 수정해야 함 마크다운 특유의 문제로, 이미지 첨부가 좀 많이 불편함 댓글 시스템인 Disquis가 비개발자에게는 많이 생소함 결국 저는 깃허브 페이지와 Hexo에 정착했습니다. 물론 단점이 존재하긴 하지만, 가입형 블로그의 서비스 종료 문제를 걱정할 필요 없이 나의 글을 저장할 수 있다는 점과 아름다운 무료 템플릿이 많다는 점이 이를 상쇄했습니다. 특히나 Jekyll과 달리 매우매우 간단한 명령어로 나만의 블로그를 업로드할 수 있다는 점이 매력적이었습니다. 저는 앞으로 당분간 이 Hexo를 활용하여 제 블로그 생활을 지속할 것 같네요. 블로그 선택에 고민하시는 (개발자) 분들께 이 포스팅이 조금이라도 도움이 되었다면 좋겠습니다.","link":"/2019/02/21/나의-블로그-플랫폼-유랑기/"}],"tags":[{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"}],"categories":[]}